In [46]:
import pandas as pd 
import seaborn as sns
import numpy as np

In [47]:
# Daten laden
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [48]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [49]:
# aller einzigartigen Werte in Spalte 'deck'
df['deck'].unique()

[NaN, 'C', 'E', 'G', 'D', 'A', 'B', 'F']
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [50]:
## aller einzigartigen Werte in Spalte 'sex'
df['sex'].unique()

array(['male', 'female'], dtype=object)

In [51]:
#wie oft jeder Wert vorkommt
df['sex'].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [52]:
#wie oft jeder Wert vorkommt
df['deck'].value_counts()

deck
C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: count, dtype: int64

In [53]:
#insert bestimmen, wo die Spalte stehen soll (hier an Index 7).
neu_list = df["sibsp"] + df["parch"] + 1
df.insert(7,'family_size',neu_list)

In [54]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'family_size', 'embarked', 'class', 'who', 'adult_male', 'deck',
       'embark_town', 'alive', 'alone'],
      dtype='object')

In [55]:
#Das Alter in Kategorien einteilen
df['age_cut'] = pd.cut(df['age'],3,labels=["kids", "jung", 'old'])

In [56]:
df.loc[:,['age','age_cut']].head()

    age age_cut
0  22.0    kids
1  38.0    jung
2  26.0    kids
3  35.0    jung
4  35.0    jung

In [ ]:
#Statistiken pro Gruppe erstellen
df.groupby('age_cut').agg({'fare':'mean', 'survived':'sum'})

/var/folders/63/b0j4zw4s4qsc9p9fz3s_r4nw0000gp/T/ipykernel_60206/3139741069.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('age_cut').agg({'fare':'mean', 'survived':'sum'})

              fare  survived
age_cut
kids     30.026803       130
jung     37.576195       144
old      44.590916        16

In [63]:
#Eine Übersichtstabelle der Überlebensraten erstellen 
pivot = df.pivot_table(
    values='survived',   # Was berechnet werden soll
    index='pclass',  # Die Zeilen    
    columns='sex',   # Die Spalten   
    aggfunc=['mean',"sum"] 
)
pivot

            mean              sum
sex       female      male female male
pclass
1       0.968085  0.368852     91   45
2       0.921053  0.157407     70   17
3       0.500000  0.135447     72   47

In [59]:
df["family_size"].head()

0    2
1    2
2    1
3    2
4    1
Name: family_size, dtype: int64

In [60]:
categories = ["Allein", "Familie"]
einteilung = [0, 1, 15]
df["familien_size_cut"] = pd.cut(df["family_size"], bins=einteilung, labels=categories)

In [61]:
df["familien_size_cut"]

0      Familie
1      Familie
2       Allein
3      Familie
4       Allein
        ...
886     Allein
887     Allein
888    Familie
889     Allein
890     Allein
Name: familien_size_cut, Length: 891, dtype: category
Categories (2, object): ['Allein' < 'Familie']

In [62]:
df.groupby('familien_size_cut').agg({'fare':'mean'})

/var/folders/63/b0j4zw4s4qsc9p9fz3s_r4nw0000gp/T/ipykernel_60206/172818424.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('familien_size_cut').agg({'fare':'mean'})

                        fare
familien_size_cut
Allein             21.242689
Familie            48.832275